mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
        }
        modeState *= anemometroCalcMode(velNmedicionesR, &timeMode[i], N_MED_MODE);

        modeState *= anemometroCalcMode(velNmedicionesT, &timeMode[1 + i], N_MED_MODE);
    }

    if (modeState == pdFAIL) return modeState;

    //Calculo V para OE
    timeCorr[0] = timeMode[0] - detect_delta_O; //taOE
    timeCorr[1] = timeMode[1] - detect_delta_E; //trOE

    if (timeCorr[0] == timeCorr[1]) {
        *medOE = 0;
    } else {
        *medOE = (((float) DISTANCE_EO / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_EO;
        *medOE = (*medOE - DETECT_OFFSET_OE) / DETECT_SCALING_OE;
    }
    //Calculo V para NS
    timeCorr[0] = timeMode[2] - detect_delta_N; //taNS
    timeCorr[1] = timeMode[3] - detect_delta_S; //trNS

    if (timeCorr[0] == timeCorr[1]) {
        *medNS = 0;
    } else {
        *medNS = (((float) DISTANCE_NS / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_NS;
        *medNS = (*medNS - DETECT_OFFSET_NS) / DETECT_SCALING_NS;
    }

    return modeState;
}

BaseType_t anemometroVmedian(float* medOE, float* medNS, uint8_t Nmedian){
    
}

BaseType_t anemometroVprom(float* medOE, float* medNS, uint8_t Nprom) {
    float medAcumOE = 0;
    float medAcumNS = 0;
    uint8_t medNpromOE = Nprom;
    uint8_t medNpromNS = Nprom;
    uint8_t i = 0;
    float medCoordOE = 0;
    float medCoordNS = 0;

    for (i = 0; i < Nprom; i++) {
        medCoordOE = anemometroGetVcoord(TRANS_EMISOR_OESTE);

        vTaskDelay(1 / portTICK_PERIOD_MS);

        medCoordNS = anemometroGetVcoord(TRANS_EMISOR_NORTE);

        if (medCoordOE < 100) {
            medAcumOE += medCoordOE;
        } else {
            medNpromOE--;
        }
        if (
                medCoordNS < 100) {
            medAcumNS += medCoordNS;
        } else {
            medNpromNS--;
        }
    }

    if (medNpromOE > (Nprom / 2) && medNpromNS > (Nprom / 2)) {
        *medOE = medAcumOE / medNpromOE;
        *medNS = medAcumNS / medNpromNS;

        return pdPASS;
    } else {
        *medOE = 666.66;
        *medNS = 666.66;
    }

    return pdFAIL;
}

float anemometroGetCoordTime(mux_transSelect_enum coordTime) {
    float timeMed = 999.99;
    uint32_t ulNotificationValue;
    BaseType_t notifyStatus = pdFAIL;
    BaseType_t pulseDetected = pdFALSE;
    BaseType_t pulseCaptured = pdFALSE;

    if (anemometroMuxOutputSelect(coordTime) != pdTRUE) {
        return timeMed;
    }
    //Desactivo MUX 2
    MUX_INPUT_INH(1);

    DELAY_50uS;

    timerStart();

    //    RB_9_SET_VAL(1);
    //    DELAY_10uS;
    //    RB_9_SET_VAL(0);
    comparadorPulseTrain_NObloq(2);
    DELAY_100uS;
    comparadorPulseTrain_NObloq(4);

    //Necesitaria esperar 400us
    DELAY_400uS;
    //    DELAY_100uS;
    DELAY_50uS;

    //Activo Mux 2
    MUX_INPUT_INH(0);
    timerStop();

    adc_start();

    pulseCaptured = dma_capturePulse(coordTime);

    //    adc_stop();

    if (pulseCaptured == pdPASS) {
        pulseDetected = dma_detectPulse(coordTime, &timeMed);

        timeMed += (((float) timerCount() / configCPU_CLOCK_HZ));

        if (pulseDetected == pdFAIL) timeMed = 888.77;

    } else {
        timeMed = 888.88;
    }

    return timeMed;
}

wind_medicion_type anemometroGetMed(void) {
    wind_medicion_type valMed = {0, 0};
    float VcoordOE = 0;
    float VcoordNS = 0;
    BaseType_t medResult = pdFAIL;

    //    //Mido en la coordenada O-E
    //    VcoordOE = anemometroGetMedProm(TRANS_EMISOR_OESTE, N_MED_PROM);
    //    //Mido en la coordenada N-S
    //    VcoordNS = anemometroGetMedProm(TRANS_EMISOR_NORTE, N_MED_PROM);
    //Tomo 10 promedios de cada coordenada 
    medResult = anemometroVprom(&VcoordOE, &VcoordNS, N_MED_PROM);

    //Calculo 
    //    valMed.mag = sqrtf(powf(VcoordOE, 2) + powf(VcoordNS, 2
    //    if (VcoordOE < 555 && VcoordNS < 555) {
    if (medResult == pdPASS) {

        valMed.mag = sqrtf(VcoordOE * VcoordOE + VcoordNS * VcoordNS);

        if (valMed.mag == 0) {
            valMed.deg = 0;
            sprintf(valMed.coord, "   ");
            return valMed;
        }

        //Correccion lineal de la medicion
        valMed.mag = (valMed.mag - MED_OFFSET) / MED_SCALING;

        if (VcoordNS != 0) {
            //Viento desde NorOeste: 0 < deg < 90
            if (VcoordOE > 0 && VcoordNS > 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS);
                if (valMed.deg < 20) {
                    sprintf(valMed.coord, " N ");
                } else if (valMed.deg > 70) {
                    sprintf(valMed.coord, " O ");
                } else {
                    sprintf(valMed.coord, "N-O");
                }
            }
            //Viento desde Sur: 90 < deg < 270
            if (VcoordNS < 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS) + 180;
                if (valMed.deg < 110) {
                    sprintf(valMed.coord, " O ");
                } else if (valMed.deg > 160 && valMed.deg < 200) {
                    sprintf(valMed.coord, " S ");
                } else if (valMed.deg > 250) {
                    sprintf(valMed.coord, " E ");
                } else {
                    if (valMed.deg < 180) {
                        sprintf(valMed.coord, "S-O");
                    } else {
                        sprintf(valMed.coord, "S-E");
                    }
                }
            }
            //Viento desde NorEste: 270 < deg < 360
            if (VcoordOE < 0 && VcoordNS > 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS) + 360;
                if (valMed.deg > 340) {
                    sprintf(valMed.coord, " N ");
                } else if (valMed.deg < 290) {
                    sprintf(valMed.coord, " E ");
                } else {
                    sprintf(valMed.coord, "N-E");
                }
            }
        } else if (VcoordOE > 0) {
            //Viento desde Oeste
            valMed.deg = 90;
            sprintf(valMed.coord, " O ");
        } else {
            //Viento desde Este
            valMed.deg = 270;
            sprintf(valMed.coord, " E ");
        }
        //Correccion lineal del angulo
        if (valMed.deg >= ANGLE_OFFSET) {
            valMed.deg = (valMed.deg - ANGLE_OFFSET) / ANGLE_SCALING;
        }
    } else {
        //Error lectura
        valMed.mag = 999.99;
        valMed.deg = 999.99;
        return valMed;
    }

